[
  {
    "title": "Charming Beachfront Villa",
    "description": "A stunning villa nestled along the pristine shoreline, offering direct access to the sandy beach. Perfect for a relaxing and rejuvenating getaway, this villa boasts breathtaking ocean views and serene surroundings. The spacious interiors are elegantly designed with comfort and luxury in mind. Enjoy your mornings with the sound of waves, and evenings with mesmerizing sunsets. The villa features a private terrace, ideal for outdoor dining and lounging. Unwind in the beautifully landscaped garden or take a stroll down to the beach. Whether you're seeking tranquility or adventure, this villa is the perfect retreat.",
    "price": 3500,
    "currency": "INR",
    "propertyType": "villa",
    "placeType": "entire-place",
    "noOfBedrooms": 4,
    "noOfBathrooms": 3,
    "noOfBeds": 5,
    "noOfGuests": 8,
    "country": "USA",
    "state": "California",
    "city": "Malibu",
    "address": "123 Ocean View Drive",
    "zipCode": "90265",
    "latitude": "34.0259",
    "longitude": "-118.7798",
    "amenities": [
      "wifi",
      "air-conditioning",
      "swimming-pool",
      "bbq-grill",
      "hot-tub"
    ],
    "nearbyActivities": ["surfing", "hiking", "wine-tasting"]
  },
  {
    "title": "Cozy Mountain Cabin",
    "description": "Escape to this cozy cabin nestled in the heart of the mountains. Perfect for a peaceful retreat, the cabin offers stunning views of the surrounding forest and mountains. The rustic interior provides a warm and inviting atmosphere, complete with a wood-burning fireplace and comfortable furnishings. Enjoy outdoor activities like hiking, fishing, and skiing nearby. The cabin features a private deck, ideal for stargazing at night. Whether you're looking for adventure or relaxation, this cabin is the perfect mountain getaway.",
    "price": 2000,
    "currency": "INR",
    "propertyType": "cabin",
    "placeType": "entire-place",
    "noOfBedrooms": 2,
    "noOfBathrooms": 2,
    "noOfBeds": 3,
    "noOfGuests": 4,
    "country": "USA",
    "state": "Colorado",
    "city": "Aspen",
    "address": "456 Mountain Trail",
    "zipCode": "81611",
    "latitude": "39.1911",
    "longitude": "-106.8175",
    "amenities": ["fireplace", "kitchen", "free-parking", "pets-allowed"],
    "nearbyActivities": ["skiing", "hiking", "fishing"]
  },
  {
    "title": "Modern City Apartment",
    "description": "Stay in the heart of the city in this modern and stylish apartment. Perfect for business travelers or tourists, this apartment offers all the comforts of home with the convenience of being close to all major attractions. The sleek and contemporary design features an open floor plan with plenty of natural light. Enjoy the vibrant city life with restaurants, shops, and entertainment just steps away. The apartment includes a fully equipped kitchen, a comfortable living area, and a private balcony with city views.",
    "price": 1500,
    "currency": "INR",
    "propertyType": "apartment",
    "placeType": "shared-place",
    "noOfBedrooms": 1,
    "noOfBathrooms": 1,
    "noOfBeds": 1,
    "noOfGuests": 2,
    "country": "USA",
    "state": "New York",
    "city": "New York",
    "address": "789 City Center Blvd",
    "zipCode": "10001",
    "latitude": "40.7128",
    "longitude": "-74.0060",
    "amenities": ["wifi", "air-conditioning", "gym", "elevator"],
    "nearbyActivities": ["shopping", "museums", "theater"]
  },
  {
    "title": "Luxurious Desert Oasis",
    "description": "Experience luxury in the desert at this stunning oasis. Perfect for a lavish getaway, this property offers breathtaking views of the desert landscape and unparalleled privacy. The spacious interiors are elegantly designed with high-end finishes and modern amenities. Relax by the infinity pool, unwind in the hot tub, or enjoy outdoor dining on the expansive patio. The oasis features a private cinema, a gourmet kitchen, and multiple outdoor seating areas. Whether you're looking to relax or explore, this desert retreat has everything you need for a luxurious vacation.",
    "price": 5000,
    "currency": "INR",
    "propertyType": "villa",
    "placeType": "entire-place",
    "noOfBedrooms": 5,
    "noOfBathrooms": 4,
    "noOfBeds": 6,
    "noOfGuests": 10,
    "country": "USA",
    "state": "Arizona",
    "city": "Scottsdale",
    "address": "1010 Desert View Road",
    "zipCode": "85255",
    "latitude": "33.4942",
    "longitude": "-111.9261",
    "amenities": [
      "wifi",
      "air-conditioning",
      "swimming-pool",
      "hot-tub",
      "cinema"
    ],
    "nearbyActivities": ["golf", "hiking", "shopping"]
  },
  {
    "title": "Chic Urban Loft",
    "description": "This chic urban loft is the perfect choice for those looking to experience city life in style. Located in a trendy neighborhood, the loft offers a unique blend of modern design and industrial charm. The open-concept living space is bright and airy, with large windows that provide plenty of natural light. Enjoy the convenience of nearby cafes, boutiques, and nightlife. The loft features a fully equipped kitchen, a spacious living area, and a cozy bedroom with a queen-sized bed. Whether you're here for business or pleasure, this loft is the ideal urban retreat.",
    "price": 175,
    "currency": "INR",
    "propertyType": "loft",
    "placeType": "entire-place",
    "noOfBedrooms": 1,
    "noOfBathrooms": 1,
    "noOfBeds": 1,
    "noOfGuests": 2,
    "country": "USA",
    "state": "California",
    "city": "Los Angeles",
    "address": "2020 Main Street",
    "zipCode": "90015",
    "latitude": "34.0522",
    "longitude": "-118.2437",
    "amenities": ["wifi", "air-conditioning", "kitchen", "pets-allowed"],
    "nearbyActivities": ["shopping", "nightlife", "museums"]
  }
]
